In [14]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn import tree
from sklearn.metrics import confusion_matrix, classification_report
from sklearn.model_selection import train_test_split

In [15]:
data = pd.read_csv("D:\\Data sets\\titanic.csv")

In [16]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [18]:
data.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [19]:
le = LabelEncoder()

In [20]:
data.Sex = le.fit_transform(data.Sex)

In [21]:
data.Age = data.Age.fillna(data.Age.mean())

In [22]:
data.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
dtype: int64

In [23]:
data.dropna()

     Survived  Pclass  Sex        Age     Fare
0           0       3    1  22.000000   7.2500
1           1       1    0  38.000000  71.2833
2           1       3    0  26.000000   7.9250
3           1       1    0  35.000000  53.1000
4           0       3    1  35.000000   8.0500
..        ...     ...  ...        ...      ...
886         0       2    1  27.000000  13.0000
887         1       1    0  19.000000  30.0000
888         0       3    0  29.699118  23.4500
889         1       1    1  26.000000  30.0000
890         0       3    1  32.000000   7.7500

[891 rows x 5 columns]

In [24]:
data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [25]:
data.Age = round(data.Age)

In [26]:
data_survived = data[data['Survived']==1]
data_survived = data_survived.head(200)

In [27]:
while(data['Survived'].value_counts()[1]<350):
    data = data.append(data_survived, ignore_index=True)

In [28]:
data['Survived'].value_counts()

0    549
1    542
Name: Survived, dtype: int64

In [29]:
data['Survived'].value_counts()[0]

549

In [30]:
data

      Survived  Pclass  Sex   Age     Fare
0            0       3    1  22.0   7.2500
1            1       1    0  38.0  71.2833
2            1       3    0  26.0   7.9250
3            1       1    0  35.0  53.1000
4            0       3    1  35.0   8.0500
...        ...     ...  ...   ...      ...
1086         1       1    1  30.0  26.5500
1087         1       3    1  26.0  56.4958
1088         1       3    1  29.0   7.7500
1089         1       1    1  36.0  26.2875
1090         1       1    0  54.0  59.4000

[1091 rows x 5 columns]

In [31]:
x = data.drop(['Survived'], axis=1)
y = data['Survived']

In [32]:
x_train, x_test, y_train, y_test = train_test_split(x,y,random_state=101, test_size=0.2)

In [33]:
dc = tree.DecisionTreeClassifier()

In [34]:
dc.fit(x_train,y_train)

DecisionTreeClassifier()

In [35]:
dc.score(x_test, y_test)

0.7853881278538812

In [36]:
pred = dc.predict(x_test)
print(confusion_matrix(pred,y_test))

[[82 18]
 [29 90]]

In [37]:
print(classification_report(pred,y_test))

              precision    recall  f1-score   support

           0       0.74      0.82      0.78       100
           1       0.83      0.76      0.79       119

    accuracy                           0.79       219
   macro avg       0.79      0.79      0.79       219
weighted avg       0.79      0.79      0.79       219